trol73/avr-make/asm/include/ATxmega32C3def.inc
.equ TCD2_CTRLA = 2304		// Control Register A
.equ TCD2_CTRLB = 2305		// Control Register B
.equ TCD2_CTRLC = 2306		// Control register C
.equ TCD2_CTRLE = 2308		// Control Register E
.equ TCD2_INTCTRLA = 2310		// Interrupt Control Register A
.equ TCD2_INTCTRLB = 2311		// Interrupt Control Register B
.equ TCD2_CTRLF = 2313		// Control Register F
.equ TCD2_INTFLAGS = 2316		// Interrupt Flag Register
.equ TCD2_LCNT = 2336		// Low Byte Count
.equ TCD2_HCNT = 2337		// High Byte Count
.equ TCD2_LPER = 2342		// Low Byte Period
.equ TCD2_HPER = 2343		// High Byte Period
.equ TCD2_LCMPA = 2344		// Low Byte Compare A
.equ TCD2_HCMPA = 2345		// High Byte Compare A
.equ TCD2_LCMPB = 2346		// Low Byte Compare B
.equ TCD2_HCMPB = 2347		// High Byte Compare B
.equ TCD2_LCMPC = 2348		// Low Byte Compare C
.equ TCD2_HCMPC = 2349		// High Byte Compare C
.equ TCD2_LCMPD = 2350		// Low Byte Compare D
.equ TCD2_HCMPD = 2351		// High Byte Compare D

;*************************************************************************
;** TCE2 - 16-bit Timer/Counter type 2
;*************************************************************************

.equ TCE2_CTRLA = 2560		// Control Register A
.equ TCE2_CTRLB = 2561		// Control Register B
.equ TCE2_CTRLC = 2562		// Control register C
.equ TCE2_CTRLE = 2564		// Control Register E
.equ TCE2_INTCTRLA = 2566		// Interrupt Control Register A
.equ TCE2_INTCTRLB = 2567		// Interrupt Control Register B
.equ TCE2_CTRLF = 2569		// Control Register F
.equ TCE2_INTFLAGS = 2572		// Interrupt Flag Register
.equ TCE2_LCNT = 2592		// Low Byte Count
.equ TCE2_HCNT = 2593		// High Byte Count
.equ TCE2_LPER = 2598		// Low Byte Period
.equ TCE2_HPER = 2599		// High Byte Period
.equ TCE2_LCMPA = 2600		// Low Byte Compare A
.equ TCE2_HCMPA = 2601		// High Byte Compare A
.equ TCE2_LCMPB = 2602		// Low Byte Compare B
.equ TCE2_HCMPB = 2603		// High Byte Compare B
.equ TCE2_LCMPC = 2604		// Low Byte Compare C
.equ TCE2_HCMPC = 2605		// High Byte Compare C
.equ TCE2_LCMPD = 2606		// Low Byte Compare D
.equ TCE2_HCMPD = 2607		// High Byte Compare D

;*************************************************************************
;** TCF2 - 16-bit Timer/Counter type 2
;*************************************************************************

.equ TCF2_CTRLA = 2816		// Control Register A
.equ TCF2_CTRLB = 2817		// Control Register B
.equ TCF2_CTRLC = 2818		// Control register C
.equ TCF2_CTRLE = 2820		// Control Register E
.equ TCF2_INTCTRLA = 2822		// Interrupt Control Register A
.equ TCF2_INTCTRLB = 2823		// Interrupt Control Register B
.equ TCF2_CTRLF = 2825		// Control Register F
.equ TCF2_INTFLAGS = 2828		// Interrupt Flag Register
.equ TCF2_LCNT = 2848		// Low Byte Count
.equ TCF2_HCNT = 2849		// High Byte Count
.equ TCF2_LPER = 2854		// Low Byte Period
.equ TCF2_HPER = 2855		// High Byte Period
.equ TCF2_LCMPA = 2856		// Low Byte Compare A
.equ TCF2_HCMPA = 2857		// High Byte Compare A
.equ TCF2_LCMPB = 2858		// Low Byte Compare B
.equ TCF2_HCMPB = 2859		// High Byte Compare B
.equ TCF2_LCMPC = 2860		// Low Byte Compare C
.equ TCF2_HCMPC = 2861		// High Byte Compare C
.equ TCF2_LCMPD = 2862		// Low Byte Compare D
.equ TCF2_HCMPD = 2863		// High Byte Compare D

;*************************************************************************
;** AWEXC - Timer/Counter Advanced Waveform Extension
;*************************************************************************

.equ AWEXC_CTRL = 2176		// Control Register
.equ AWEXC_FDEMASK = 2178		// Fault Detection Event Mask
.equ AWEXC_FDCTRL = 2179		// Fault Detection Control Register
.equ AWEXC_STATUS = 2180		// Status Register
.equ AWEXC_STATUSSET = 2181		// Status Set Register
.equ AWEXC_DTBOTH = 2182		// Dead Time Both Sides
.equ AWEXC_DTBOTHBUF = 2183		// Dead Time Both Sides Buffer
.equ AWEXC_DTLS = 2184		// Dead Time Low Side
.equ AWEXC_DTHS = 2185		// Dead Time High Side
.equ AWEXC_DTLSBUF = 2186		// Dead Time Low Side Buffer
.equ AWEXC_DTHSBUF = 2187		// Dead Time High Side Buffer
.equ AWEXC_OUTOVEN = 2188		// Output Override Enable

;*************************************************************************
;** HIRESC - Timer/Counter High-Resolution Extension
;*************************************************************************

.equ HIRESC_CTRLA = 2192		// Control Register

;*************************************************************************
;** USARTC0 - Universal Asynchronous Receiver-Transmitter
;*************************************************************************

.equ USARTC0_DATA = 2208		// Data Register
.equ USARTC0_STATUS = 2209		// Status Register
.equ USARTC0_CTRLA = 2211		// Control Register A
.equ USARTC0_CTRLB = 2212		// Control Register B
.equ USARTC0_CTRLC = 2213		// Control Register C
.equ USARTC0_BAUDCTRLA = 2214		// Baud Rate Control Register A
.equ USARTC0_BAUDCTRLB = 2215		// Baud Rate Control Register B

;*************************************************************************
;** USARTD0 - Universal Asynchronous Receiver-Transmitter
;*************************************************************************

.equ USARTD0_DATA = 2464		// Data Register
.equ USARTD0_STATUS = 2465		// Status Register
.equ USARTD0_CTRLA = 2467		// Control Register A
.equ USARTD0_CTRLB = 2468		// Control Register B
.equ USARTD0_CTRLC = 2469		// Control Register C
.equ USARTD0_BAUDCTRLA = 2470		// Baud Rate Control Register A
.equ USARTD0_BAUDCTRLB = 2471		// Baud Rate Control Register B

;*************************************************************************
;** USARTE0 - Universal Asynchronous Receiver-Transmitter
;*************************************************************************

.equ USARTE0_DATA = 2720		// Data Register
.equ USARTE0_STATUS = 2721		// Status Register
.equ USARTE0_CTRLA = 2723		// Control Register A
.equ USARTE0_CTRLB = 2724		// Control Register B
.equ USARTE0_CTRLC = 2725		// Control Register C
.equ USARTE0_BAUDCTRLA = 2726		// Baud Rate Control Register A
.equ USARTE0_BAUDCTRLB = 2727		// Baud Rate Control Register B

;*************************************************************************
;** SPIC - Serial Peripheral Interface
;*************************************************************************

.equ SPIC_CTRL = 2240		// Control Register
.equ SPIC_INTCTRL = 2241		// Interrupt Control Register
.equ SPIC_STATUS = 2242		// Status Register
.equ SPIC_DATA = 2243		// Data Register

;*************************************************************************
;** SPID - Serial Peripheral Interface
;*************************************************************************

.equ SPID_CTRL = 2496		// Control Register
.equ SPID_INTCTRL = 2497		// Interrupt Control Register
.equ SPID_STATUS = 2498		// Status Register
.equ SPID_DATA = 2499		// Data Register

;*************************************************************************
;** IRCOM - IR Communication Module
;*************************************************************************

.equ IRCOM_CTRL = 2296		// Control Register
.equ IRCOM_TXPLCTRL = 2297		// IrDA Transmitter Pulse Length Control Register
.equ IRCOM_RXPLCTRL = 2298		// IrDA Receiver Pulse Length Control Register


; ***** ALL MODULE BASE ADRESSES *****************************************

.equ GPIO_base = 0x0000		// General Purpose IO
.equ VPORT0_base = 0x0010		// Virtual Ports
.equ VPORT1_base = 0x0014		// Virtual Ports
.equ VPORT2_base = 0x0018		// Virtual Ports
.equ VPORT3_base = 0x001C		// Virtual Ports
.equ OCD_base = 0x002E		// On-Chip Debug System
.equ CPU_base = 0x0030		// CPU
.equ CLK_base = 0x0040		// Clock System
.equ PR_base = 0x0070		// Clock System
.equ SLEEP_base = 0x0048		// Sleep Controller
.equ OSC_base = 0x0050		// Oscillator
.equ DFLLRC32M_base = 0x0060		// DFLL
.equ DFLLRC2M_base = 0x0068		// DFLL
.equ RST_base = 0x0078		// Reset
.equ WDT_base = 0x0080		// Watch-Dog Timer
.equ MCU_base = 0x0090		// MCU Control
.equ PMIC_base = 0x00A0		// Programmable Multi-level Interrupt Controller
.equ PORTCFG_base = 0x00B0		// Port Configuration
.equ CRC_base = 0x00D0		// Cyclic Redundancy Checker
.equ EVSYS_base = 0x0180		// Event System
.equ NVM_base = 0x01C0		// Non Volatile Memory Controller
.equ ADCA_base = 0x0200		// Analog/Digital Converter
.equ ACA_base = 0x0380		// Analog Comparator
.equ RTC_base = 0x0400		// Real-Time Counter
.equ TWIC_base = 0x0480		// Two-Wire Interface
.equ TWIE_base = 0x04A0		// Two-Wire Interface
.equ USB_base = 0x04C0		// USB
.equ PORTA_base = 0x0600		// I/O Port Configuration
.equ PORTB_base = 0x0620		// I/O Port Configuration
.equ PORTC_base = 0x0640		// I/O Port Configuration
.equ PORTD_base = 0x0660		// I/O Port Configuration
.equ PORTE_base = 0x0680		// I/O Port Configuration
.equ PORTF_base = 0x06A0		// I/O Port Configuration
.equ PORTR_base = 0x07E0		// I/O Port Configuration
.equ TCC0_base = 0x0800		// 16-bit Timer/Counter With PWM
.equ TCC1_base = 0x0840		// 16-bit Timer/Counter With PWM
.equ TCD0_base = 0x0900		// 16-bit Timer/Counter With PWM
.equ TCE0_base = 0x0A00		// 16-bit Timer/Counter With PWM
.equ TCF0_base = 0x0B00		// 16-bit Timer/Counter With PWM
.equ TCC2_base = 0x0800		// 16-bit Timer/Counter type 2
.equ TCD2_base = 0x0900		// 16-bit Timer/Counter type 2
.equ TCE2_base = 0x0A00		// 16-bit Timer/Counter type 2
.equ TCF2_base = 0x0B00		// 16-bit Timer/Counter type 2
.equ AWEXC_base = 0x0880		// Timer/Counter Advanced Waveform Extension
.equ HIRESC_base = 0x0890		// Timer/Counter High-Resolution Extension
.equ USARTC0_base = 0x08A0		// Universal Asynchronous Receiver-Transmitter
.equ USARTD0_base = 0x09A0		// Universal Asynchronous Receiver-Transmitter
.equ USARTE0_base = 0x0AA0		// Universal Asynchronous Receiver-Transmitter
.equ SPIC_base = 0x08C0		// Serial Peripheral Interface
.equ SPID_base = 0x09C0		// Serial Peripheral Interface
.equ IRCOM_base = 0x08F8		// IR Communication Module


