trol73/avr-make/asm/include/ATxmega32C3def.inc
; ACA interrupt vectors
.equ ACA_AC0_vect = 136 ; AC0 Interrupt
.equ ACA_AC1_vect = 138 ; AC1 Interrupt
.equ ACA_ACW_vect = 140 ; ACW Window Mode Interrupt

; ADCA interrupt vectors
.equ ADCA_CH0_vect = 142 ; Interrupt 0

; TCD0 interrupt vectors
.equ TCD0_OVF_vect = 154 ; Overflow Interrupt
.equ TCD0_ERR_vect = 156 ; Error Interrupt
.equ TCD0_CCA_vect = 158 ; Compare or Capture A Interrupt
.equ TCD0_CCB_vect = 160 ; Compare or Capture B Interrupt
.equ TCD0_CCC_vect = 162 ; Compare or Capture C Interrupt
.equ TCD0_CCD_vect = 164 ; Compare or Capture D Interrupt

; TCD2 interrupt vectors
.equ TCD2_LUNF_vect = 154 ; Low Byte Underflow Interrupt
.equ TCD2_HUNF_vect = 156 ; High Byte Underflow Interrupt
.equ TCD2_LCMPA_vect = 158 ; Low Byte Compare A Interrupt
.equ TCD2_LCMPB_vect = 160 ; Low Byte Compare B Interrupt
.equ TCD2_LCMPC_vect = 162 ; Low Byte Compare C Interrupt
.equ TCD2_LCMPD_vect = 164 ; Low Byte Compare D Interrupt

; SPID interrupt vectors
.equ SPID_INT_vect = 174 ; SPI Interrupt

; USARTD0 interrupt vectors
.equ USARTD0_RXC_vect = 176 ; Reception Complete Interrupt
.equ USARTD0_DRE_vect = 178 ; Data Register Empty Interrupt
.equ USARTD0_TXC_vect = 180 ; Transmission Complete Interrupt

; PORTF interrupt vectors
.equ PORTF_INT0_vect = 208 ; External Interrupt 0
.equ PORTF_INT1_vect = 210 ; External Interrupt 1

; TCF0 interrupt vectors
.equ TCF0_OVF_vect = 216 ; Overflow Interrupt
.equ TCF0_ERR_vect = 218 ; Error Interrupt
.equ TCF0_CCA_vect = 220 ; Compare or Capture A Interrupt
.equ TCF0_CCB_vect = 222 ; Compare or Capture B Interrupt
.equ TCF0_CCC_vect = 224 ; Compare or Capture C Interrupt
.equ TCF0_CCD_vect = 226 ; Compare or Capture D Interrupt

; TCF2 interrupt vectors
.equ TCF2_LUNF_vect = 216 ; Low Byte Underflow Interrupt
.equ TCF2_HUNF_vect = 218 ; High Byte Underflow Interrupt
.equ TCF2_LCMPA_vect = 220 ; Low Byte Compare A Interrupt
.equ TCF2_LCMPB_vect = 222 ; Low Byte Compare B Interrupt
.equ TCF2_LCMPC_vect = 224 ; Low Byte Compare C Interrupt
.equ TCF2_LCMPD_vect = 226 ; Low Byte Compare D Interrupt

; USB interrupt vectors
.equ USB_BUSEVENT_vect = 250 ; SOF, suspend, resume, reset bus event interrupts, crc, underflow, overflow and stall error interrupts
.equ USB_TRNCOMPL_vect = 252 ; Transaction complete interrupt



; ***** INTERRUPT VECTORS, MODULE BASES **********************************

.equ OSC_vbase = 2
.equ PORTC_vbase = 4
.equ PORTR_vbase = 8
.equ RTC_vbase = 20
.equ TWIC_vbase = 24
.equ TCC0_vbase = 28
.equ TCC2_vbase = 28
.equ TCC1_vbase = 40
.equ SPIC_vbase = 48
.equ USARTC0_vbase = 50
.equ NVM_vbase = 64
.equ PORTB_vbase = 68
.equ PORTE_vbase = 86
.equ TWIE_vbase = 90
.equ TCE0_vbase = 94
.equ TCE2_vbase = 94
.equ USARTE0_vbase = 116
.equ PORTD_vbase = 128
.equ PORTA_vbase = 132
.equ ACA_vbase = 136
.equ ADCA_vbase = 142
.equ TCD0_vbase = 154
.equ TCD2_vbase = 154
.equ SPID_vbase = 174
.equ USARTD0_vbase = 176
.equ PORTF_vbase = 208
.equ TCF0_vbase = 216
.equ TCF2_vbase = 216
.equ USB_vbase = 250


; ***** INTERRUPT VECTORS, VECTOR OFFSETS ********************************

; OSC interrupt vector offsets

.equ OSC_OSCF_voffset = 0

; PORTC interrupt vector offsets

.equ PORTC_INT0_voffset = 0
.equ PORTC_INT1_voffset = 2

; PORTR interrupt vector offsets

.equ PORTR_INT0_voffset = 0
.equ PORTR_INT1_voffset = 2

; RTC interrupt vector offsets

.equ RTC_OVF_voffset = 0
.equ RTC_COMP_voffset = 2

; TWIC interrupt vector offsets

.equ TWIC_TWIS_voffset = 0
.equ TWIC_TWIM_voffset = 2

; TCC0 interrupt vector offsets

.equ TCC0_OVF_voffset = 0
.equ TCC0_ERR_voffset = 2
.equ TCC0_CCA_voffset = 4
.equ TCC0_CCB_voffset = 6
.equ TCC0_CCC_voffset = 8
.equ TCC0_CCD_voffset = 10

; TCC2 interrupt vector offsets

.equ TCC2_LUNF_voffset = 0
.equ TCC2_HUNF_voffset = 2
.equ TCC2_LCMPA_voffset = 4
.equ TCC2_LCMPB_voffset = 6
.equ TCC2_LCMPC_voffset = 8
.equ TCC2_LCMPD_voffset = 10

; TCC1 interrupt vector offsets

.equ TCC1_OVF_voffset = 0
.equ TCC1_ERR_voffset = 2
.equ TCC1_CCA_voffset = 4
.equ TCC1_CCB_voffset = 6

; SPIC interrupt vector offsets

.equ SPIC_INT_voffset = 0

; USARTC0 interrupt vector offsets

.equ USARTC0_RXC_voffset = 0
.equ USARTC0_DRE_voffset = 2
.equ USARTC0_TXC_voffset = 4

; NVM interrupt vector offsets

.equ NVM_EE_voffset = 0
.equ NVM_SPM_voffset = 2

; PORTB interrupt vector offsets

.equ PORTB_INT0_voffset = 0
.equ PORTB_INT1_voffset = 2

; PORTE interrupt vector offsets

.equ PORTE_INT0_voffset = 0
.equ PORTE_INT1_voffset = 2

; TWIE interrupt vector offsets

.equ TWIE_TWIS_voffset = 0
.equ TWIE_TWIM_voffset = 2

; TCE0 interrupt vector offsets

.equ TCE0_OVF_voffset = 0
.equ TCE0_ERR_voffset = 2
.equ TCE0_CCA_voffset = 4
.equ TCE0_CCB_voffset = 6
.equ TCE0_CCC_voffset = 8
.equ TCE0_CCD_voffset = 10

; TCE2 interrupt vector offsets

.equ TCE2_LUNF_voffset = 0
.equ TCE2_HUNF_voffset = 2
.equ TCE2_LCMPA_voffset = 4
.equ TCE2_LCMPB_voffset = 6
.equ TCE2_LCMPC_voffset = 8
.equ TCE2_LCMPD_voffset = 10

; USARTE0 interrupt vector offsets

.equ USARTE0_RXC_voffset = 0
.equ USARTE0_DRE_voffset = 2
.equ USARTE0_TXC_voffset = 4

; PORTD interrupt vector offsets

.equ PORTD_INT0_voffset = 0
.equ PORTD_INT1_voffset = 2

; PORTA interrupt vector offsets

.equ PORTA_INT0_voffset = 0
.equ PORTA_INT1_voffset = 2

; ACA interrupt vector offsets

.equ ACA_AC0_voffset = 0
.equ ACA_AC1_voffset = 2
.equ ACA_ACW_voffset = 4

; ADCA interrupt vector offsets

.equ ADCA_CH0_voffset = 0

; TCD0 interrupt vector offsets

.equ TCD0_OVF_voffset = 0
.equ TCD0_ERR_voffset = 2
.equ TCD0_CCA_voffset = 4
.equ TCD0_CCB_voffset = 6
.equ TCD0_CCC_voffset = 8
.equ TCD0_CCD_voffset = 10

; TCD2 interrupt vector offsets

.equ TCD2_LUNF_voffset = 0
.equ TCD2_HUNF_voffset = 2
.equ TCD2_LCMPA_voffset = 4
.equ TCD2_LCMPB_voffset = 6
.equ TCD2_LCMPC_voffset = 8
.equ TCD2_LCMPD_voffset = 10

; SPID interrupt vector offsets

.equ SPID_INT_voffset = 0

; USARTD0 interrupt vector offsets

.equ USARTD0_RXC_voffset = 0
.equ USARTD0_DRE_voffset = 2
.equ USARTD0_TXC_voffset = 4

; PORTF interrupt vector offsets

.equ PORTF_INT0_voffset = 0
.equ PORTF_INT1_voffset = 2

; TCF0 interrupt vector offsets

.equ TCF0_OVF_voffset = 0
.equ TCF0_ERR_voffset = 2
.equ TCF0_CCA_voffset = 4
.equ TCF0_CCB_voffset = 6
.equ TCF0_CCC_voffset = 8
.equ TCF0_CCD_voffset = 10

; TCF2 interrupt vector offsets

.equ TCF2_LUNF_voffset = 0
.equ TCF2_HUNF_voffset = 2
.equ TCF2_LCMPA_voffset = 4
.equ TCF2_LCMPB_voffset = 6
.equ TCF2_LCMPC_voffset = 8
.equ TCF2_LCMPD_voffset = 10

; USB interrupt vector offsets

.equ USB_BUSEVENT_voffset = 0
.equ USB_TRNCOMPL_voffset = 2



.equ INT_VECTORS_SIZE = 254 ; size in words


#endif /* _ATXMEGA32C3DEF_INC_ */

; ***** END OF FILE ******************************************************



